Repository: assembla/tsvn
Catalog: doc/po/TortoiseMerge_*.po
Languages: cs

source: A diff/merge tool for Windows
cs: Nástroj porovnání/sloučení pro Windows

source: First
cs: První

source: Preface
cs: Předmluva

source: When working on a project, either an open-source project where several people review your code, or a commercial project where you sell a component with your source code, there will be people and customers who find bugs or want to improve your project. To do that they send you patches which you have to review and decide if you want to apply them.
cs: Při práci na projektu a to buď na open-source projektu, ve kterém více lidí kontroluje Váš kód, nebo komerční projekt, kde budete prodávat komponentu s Vašim zdrojovým kódem, najdou se lidi a zákazníci, kteří najdou chyby, nebo chtějí zlepšit Váš projekt. Aby toto provedli, posílají Vám záplaty, které budete muset zhlédnout a rozhodnout, zda ji chcete použít.

source: Reviewing patches
cs: Přezkoumání záplat

source: Applying the patches
cs: Uplatnění záplat

source: TortoiseMerge helps you with both those tasks: <placeholder-1/>
cs: TortoiseMerge Vám pomůže s oběma těmito úkoly: <placeholder-1/>

source: TortoiseMerge also helps you to sort out conflicted files which can occur if you're working with a source control system and others are working on the same files as you.
cs: TortoiseMerge také Vám pomáhá vyřešit konfliktní soubory, které mohou nastat, pokud pracujete se systémem pro správu verzí a ostatní pracují na stejném soubory jako Vy.

source: TortoiseMerge is free!
cs: TortoiseMerge je zdarma!

source: TortoiseMerge is free. You don't have to pay for it, you can use it any way you want. It is developed under the GP license (GPL).
cs: TortoiseMerge je zdarma. Nemusíte platit za něj platit, můžete jej použít jakýmkoli způsobem, kterým chcete. Je vyvíjen pod licencí GP (GPL).

source: Donate!
cs: Přispějte!

source: Even though TortoiseSVN and TortoiseMerge are free, you can support the developers by sending in patches and play an active role in the development. You can also help to cheer us up during the endless hours we spend in front of our computers.
cs: I když TortoiseSVN a TortoiseMerge jsou zdarma, můžete podpořit vývojáře zasláním záplat a hrát aktivní roli ve vývoji. Můžete také pomoci nás povzbudit během nekonečných hodin, které trávíme před našimi počítači.

source: Acknowledgments
cs: Poděkování

source: for the hard work on TortoiseMerge
cs: za tvrdou práci na TortoiseMerge

source: for the beautiful icons, logo, bug hunting and taking care of the documentation
cs: za nádherné ikony, logo, odchyt chyb a péči o dokumentaci

source: The Tigris Style project
cs: Projektu Tigris Style

source: for some of the styles which are reused in this documentation
cs: za některé styly, které byly použity v této dokumentaci

source: Our Contributors
cs: Našim Přispěvatelům

source: for the patches, bug reports and new ideas, and for helping others by answering questions on our mailing list.
cs: za opravy, hlášení chyb a nové nápady, a za pomoc druhým odpovídáním na otázky týkající se našeho mailing listu.

source: Our Donators
cs: Našim Dárcům

source: for many hours of joy with the music they sent us
cs: za mnoho hodin radosti s hudbou, kterou nám poslali

source: Introduction
cs: Úvod

source: Overview
cs: Přehled

source: TortoiseMerge is a free/open-source application. It lets you see differences in text files, merge those changes and even review and apply unified diff files, often called <firstterm>patches</firstterm>.
cs: TortoiseMerge je zdarma/open-source aplikace. Umožní Vám vidět rozdíly v textových souborech, sloučit tyto změny a dokonce i kontrolovat a uplatnit soubory sjednoceného rozdílu, často nazývané <firstterm>záplaty</firstterm>.

source: While working on text files, e.g. source files in your favourite programming language, or html/xml files for your documentation or website, you will often have a situation where you need to compare different versions of those files. Sometimes you get a different version from someone else, sometimes you just want to see the changes you've made.
cs: Při práci na textových souborech, např. zdrojové soubory ve Vašem oblíbeném programovacím jazyce, nebo html/xml soubory pro Vaše dokumenty nebo webové stránky, budete často v situaci, kdy je třeba porovnat různé verze těchto souborů. Někdy máte jinou verzi od někoho jiného, někdy jen chcete vidět změny, které jste provedli.

source: If you're working with a version control system (e.g. Subversion) then you sometimes get <emphasis>conflicts</emphasis> when you update your working copy. This happens if someone else changed the same parts of the file you're currently working on as you did. Then you have to resolve those conflicts manually. This is where TortoiseMerge can help you.
cs: Pokud pracujete se systémem pro správu verzí (např. Subversion), pak někdy při aktualizaci Vaší pracovní kopie dostanete <emphasis>konflikt</emphasis>. Ten nastane, pokud někdo jiný změnil stejné části souboru, na kterém v současné době pracujete ve stejnou dobu. Pak budete muset tyto konflikty ručně vyřešit. Zde Vám TortoiseMerge může pomoci.

source: The following diagram shows you the relationships between the files involved in a conflict:
cs: Následující graf zobrazuje vztah mezi soubory zapojené do konfliktu:

source: File Conflict
cs: Konflikt souboru

source: A conflict can also occur if you try to apply an outdated patch file. In such cases, without TortoiseMerge, you would either have to ask the person you got that patch file from for a current version or try to apply that patch file manually.
cs: Konflikt také může nastat, pokud se pokusíte použít zastaralý záplatový soubor. V takových případech, bez TortoiseMerge, byste museli buď požádat osobu, od které jste dostali tento záplatový soubor, o aktuální verzi, nebo zkusili uplatnit záplatový soubor ručně.

source: But now with TortoiseMerge this isn't necessary anymore - at least not if you're working with a version control system like Subversion. TortoiseMerge parses the patch file for the revision/version the patch was created for and automatically tries to fetch that specific version from your source-control. Then it applies the patch and lets you review both your changes to the file, and theirs. Then you can decide which changes you want to keep.
cs: Ale nyní s TortoiseMerge to už není nutné - alespoň ne, pokud pracujete se systémem pro správu verzí, jako je Subversion. TortoiseMerge záplatový soubor rozebere na revizi/verzi, pro kterou byl vytvořen a automaticky se pokusí načíst konkrétní verzi ze systému pro správu verzí. Pak použije záplatu a umožňí Vám prozkoumat jak Vaše změny v souboru, tak jejich. Pak se můžete rozhodnout, které změny chcete zachovat.

source: TortoiseMerge's History
cs: Historie TortoiseMerge

source: This was also the main reason why TortoiseSVN did not originally have a <menuchoice><guimenu>TortoiseSVN</guimenu><guimenuitem>Create Patch</guimenuitem></menuchoice> implemented: we preferred users to send us the whole files because with those it was easier to apply patches.
cs: Toto byl také hlavní důvod, proč TortoiseSVN původně neměl zavedenu <menuchoice><guimenu>TortoiseSVN</guimenu><guimenuitem>Vytvořit Záplatu</guimenuitem></menuchoice>: dávali jsme přednost, aby uživatelé nám posílali celé soubory, protože s nimi bylo snadnější záplaty použít.

source: So we spent a lot of time, searching the Internet for a GUI tool which could apply patch files, but all we found was that such a tool didn't exist. So to cut a long story short: We decided that if no-one else could provide such a tool we would have to write our own. That's when TortoiseMerge was born.
cs: Tak jsme strávili spoustu času, prohledáváním internetu pro GUI nástroj, který by mohl používat záplatové soubory, ale pouze jsme zjistili, že takový nástroj neexistuje. Takže suma sumárum: Rozhodli jsme se, že pokud nikdo jiný nemůže poskytnout takový nástroj, musíme si napsat vlastní. A tehdy se zrodil TortoiseMerge.

source: Since TortoiseSVN already uses the Subversion library, which has a nice diffing engine built in, it was just natural to use this library instead of the GNU diff.
cs: Vzhledem k tomu, že TortoiseSVN již používá knihovnu Subversion, který už má v sobě pěkné jádro porovnávání, bylo jen přirozené použít tuto knihovnu místo GNU diff.

source: Basic Concepts
cs: Základní představa

source: Viewing the difference between two files and merging changes into one of them, or removing unwanted changes.
cs: Zobrazení rozdílu mezi dvěma soubory a slučování změn do jednoho z nich, nebo odstraňování nežádoucích změn.

source: Editing conflicts between local changes and changes in the Subversion repository following an update.
cs: Úprava konfliktů mezi místními změnami a změnami v úložišti Subversion po aktualizaci.

source: Applying patch files. This is the reason TortoiseMerge was created :)
cs: Uplatnění záplatových souborů. To je důvod, proč byl TortoiseMerge vytvořen:)

source: TortoiseMerge has several different uses: <placeholder-1/>
cs: TortoiseMerge má několik různých použití: <placeholder-1/>

source: Viewing and Merging Differences
cs: Prohlížení a Sloučení Rozdílů

source: In this mode you are comparing two files. The file in the left pane is considered to be the original file (sometimes referred to as <emphasis>Theirs</emphasis>, and the file in the right pane is the modified file (sometimes referred to as <emphasis>Mine</emphasis>.
cs: V tomto režimu porovnáváte dva soubory. Soubor v levém panelu je považován za původní soubor (někdy označován jako <emphasis>Jejich</emphasis> a soubor v pravém panelu je upravený soubor (někdy označované jako <emphasis>Můj</emphasis>.

source: Reverting changed lines back to the text shown in the left pane.
cs: Vrátit změněné řádky zpět na text zobrazený v levém panelu.

source: Using a combination of both blocks, either <emphasis>Theirs</emphasis> before <emphasis>Mine</emphasis> or <emphasis>Mine</emphasis> before <emphasis>Theirs</emphasis>.
cs: Pomocí kombinace obou bloků, a to buď <emphasis>Jejich</emphasis> před <emphasis>Můj</emphasis>, nebo <emphasis>Můj</emphasis> před <emphasis>Jejich</emphasis>.

source: You can make simple line-based changes to the file in the right pane which include: <placeholder-1/>
cs: Můžete provést jednoduché změny řádků v souborů v pravém panelu, které zahrnují: <placeholder-1/>

source: You can also edit the file in the right pane just as you would in a text editor. Such lines are marked using a pencil icon. Please note that if you want to make any of the line/block-based changes described above, it is better to do those first since once you start editing the file yourself it becomes impossible for TortoiseMerge to keep track of the relationship to the original files.
cs: Můžete soubor také upravit v pravém panelu, stejně jako v textovém editoru. Takové linky jsou označeny ikonou tužky. Vezměte prosím na vědomí, že pokud chcete některé ze změn řádků/bloků popsaných výše, je lepší je provést jako první, protože jakmile začnete upravovat soubor sami, stane se pro TortoiseMerge nemožné sledovat vztahy s původním souborem.

source: Editing Conflicts
cs: Úprava Konfliktů

source: This is sometimes referred to as a three-way merge, and is shown in three panes. However there are actually four files involved. The file which is not shown is the common base file, the last common ancestor of the two files which are now in conflict. The relationships between the three files are explained in the diagram below:
cs: Tomuto se někdy říká trojité porovnávání sloučení a je uvedeno ve třech panelech. Vlastně jsou však zahrnuty čtyři soubory. Soubor, který není zobrazen, je soubor společného základu, poslední společný předek dvou souborů, které jsou nyní v konfliktu. Vztahy mezi třemi soubory jsou popsány v níže uvedeném diagramu:

source: The base file represents the oldest version of a file, from where <emphasis>You</emphasis> and <emphasis>They</emphasis> start making changes. <emphasis>Mine</emphasis> represents the base file with all the changes <emphasis>you</emphasis> made, and <emphasis>Theirs</emphasis> is the file with all the changes <emphasis>someone else</emphasis> made to the file. The left pane shows the changes in <emphasis>Theirs</emphasis> relative to the base file and the right pane shows the changes in <emphasis>Mine</emphasis> relative to the base file. The bottom pane is the output file which is where you are trying to resolve the conflicts.
cs: Základní soubor představuje nejstarší verzi souboru, odkud <emphasis>Vy</emphasis> a <emphasis>Oni</emphasis> začnete dělat změny. <emphasis>Můj</emphasis> představuje základní soubor se všemi změnami, které jste <emphasis>Vy</emphasis> provedli a <emphasis>Jejich</emphasis> je soubor se všemi změnami, které <emphasis>někdo jiný</emphasis> v souboru provedl. Levý panel zobrazuje změny v <emphasis>Jejich</emphasis> oproti základnímu souboru a pravý panel zobrazuje změny v <emphasis>Mém</emphasis> oproti základnímu souboru. Dolní panel je výstupní soubor, kde se snažíte vyřešit konflikty.

source: In conflict resolution view, you can choose to use blocks from <emphasis>Mine</emphasis> or <emphasis>Theirs</emphasis> or both. But in this case, the changes are shown in the bottom pane.
cs: V zobrazení řešení konfliktů můžete použít bloky z <emphasis>Můj</emphasis> nebo <emphasis>Jejich</emphasis> nebo obojí. Ale v tomto případě jsou změny uvedeny ve spodním panelu.

source: Applying Patches
cs: Uplatnění Záplat

source: A patch file is a Subversion unified diff file, which contains the information required to apply changes to a set of files. The patch may have been supplied by another developer so that you can see changes he has made and possibly commit them to the repository. Or it may have been generated internally by TortoiseSVN when comparing two folders. This happens when you compare a repository revision with your working copy folder, or if you compare two different repository revisions, or if you compare two different repository paths.
cs: Záplatový soubor je soubor sjednoceného rozdílu Subversion, který obsahuje informace potřebné k použití změn na sadu souborů. Záplata může být dodána jiným vývojářem, takže můžete vidět změny, které udělal a možná je odevzdat do úložiště. Nebo mohl být interně vytvořen TortoiseSVN při porovnávání dvou adresářů. To se stane, když porovnáte revizi úložiště s adresářem Vaší pracovní kopie, nebo pokud porovnáváte dvě různé revize úložiště, nebo pokud porovnáváte dvě různé cesty úložiště.

source: In either case TortoiseMerge will show a small window listing the files included in the patch. By double clicking on one of these files you fetch the relevant file and apply the changes. The left pane shows the original file content and the right pane shows it after the patch is applied.
cs: V každém případě TortoiseMerge zobrazí malé okno se seznamem souborů zahrnutých v záplatě. Dvojitým kliknutím na jeden z těchto souborů můžete načíst příslušný soubor a změny uplatit. Levý panel zobrazí původní obsah souboru a pravý panelu ho zobrazuje poté, co byla záplata použita.

source: You can edit the file in the right pane exactly as you would in compare/edit mode.
cs: Můžete upravit soubor v pravém panelu přesně tak, jak byste dělali v režimu porovnání/úprav.

source: Using TortoiseMerge
cs: Použití TortoiseMerge

source: Viewing Modes
cs: Režimy prohlížení

source: TortoiseMerge has three main viewing modes: one-pane, two-pane and three-pane view. One/two-pane view is used to view changes and three-pane view is used to resolve conflicts.
cs: TortoiseMerge má tři hlavní způsoby zobrazení: jedno panelový, dvou panelový a tři panelový pohled. Jeden/dvou panelový pohled se používá k zobrazení změn a tří panelový pohled se používá k řešení konfliktů.

source: Viewing / Merging
cs: Prohlížení / Sloučení

source: One Pane View
cs: Jedno panelové Zobrazení

source: Two Pane View
cs: Dvou panelové Zobrazení

source: Changes inside the modified lines are shown in different colors. Added string parts are shown with a lighter color, but you can of course configure the colors used here. Removed parts are indicated with a dark brown vertical line in the string. Check out the screenshot above to see how this works.
cs: Změny uvnitř upravených řádků jsou zobrazeny v různých barvách. Přidané části řetězce jsou zobrazeny světlejší barvou, ale můžete samozřejmě používané barvy zde nastavit. Odstraněné části jsou v řetězci uvedeny tmavě hnědou svislou čárou. Podívejte se na obrázek výše, abyste viděli, jak to funguje.

source: Code reorganization usually means a lot of changes in whitespaces (space, tab, newlines) but no actual code change. For example, you split up a very long line into several lines, or you sometimes compact several lines together into one.
cs: Reorganizace kódu obvykle znamená spoustu změn v mezerách (mezerník, tabulátor, nové řádky), ale žádné skutečné změny kódu. Například můžete rozdělit velmi dlouhý řádek do několika řádků, nebo někdy zhustíte několik řádků do jednoho.

source: Such changes are marked with a white circle symbol on the left side of the views. If you see such a white circle, you know immediately that no real code change is there and you don't have to check the changed block further.
cs: Takové změny jsou označeny symbolem bílého kruhu na levé straně zobrazení. Pokud vidíte takový bílý kruh, víte hned, že tam nejsou žádné skutečné změny kódu a nemusíte už dále kontrolovat změněny blok.

source: Hand editing of the file in the right pane is possible in two-pane view. Such changes are marked with a pencil symbol.
cs: Ruční úprava souboru v pravém panelu je možné ve dvou panelovém zobrazení. Takové změny jsou označeny symbolem tužky.

source: The two pane view has some features which are not available in the one pane view: <placeholder-1/>
cs: Dvou panelový pohled má některé vlastnosti, které nejsou dostupné v jednopanelovém zobrazení: <placeholder-1/>

source: If you want to compare/merge three files, TortoiseMerge will show you the differences in a three pane view. This view is also used if you need to resolve conflicted files.
cs: Pokud chcete porovnat/sloučit tři soubory, TortoiseMerge zobrazí rozdíly ve tří panelovém zobrazení. Toto zobrazení je také použito, pokud potřebujete vyřešit soubory v konfliktu.

source: Three Pane View
cs: Tří panelové zobrazení

source: The left pane shows you the differences between <emphasis>Their</emphasis> file and the <emphasis>Base</emphasis> file, while the right pane shows you the differences between <emphasis>Mine</emphasis> file and the <emphasis>Base</emphasis> file. The bottom pane shows you the result of merging <emphasis>Base</emphasis>, <emphasis>Mine</emphasis> and <emphasis>Theirs</emphasis> with possible conflicts.
cs: Levý panel zobrazuje rozdíly mezi <emphasis>Jejich</emphasis> a <emphasis>Původním</emphasis> souborem, zatímco pravý panel zobrazuje rozdíly mezi <emphasis>Mými</emphasis> a <emphasis>Původním</emphasis> souborem. Dolní panel zobrazuje výsledek sloučení <emphasis>Původního</emphasis>, <emphasis>Mého</emphasis> a <emphasis>Jejich</emphasis> s možnými konflikty.

source: If you hover the mouse over the pane title, a tooltip will show the filenames used for the diff in each pane.
cs: Pokud myší najedete nad název panelu, popisek v každém panelu zobrazí názvy souborů použitých pro porovnání.

source: Patch File List
cs: Seznam Záplatových Souborů

source: After TortoiseMerge parses the patch file it will show you a small window with all the files which have changes according to the patch file. <placeholder-1/> If the filename is shown in black, then the patch can be applied without any problems. That means the file is not outdated according to the patch. However, if the filename is shown in red, then the patch can't get applied directly because you already changed that file.
cs: Až TortoiseMerge záplatový soubor rozebere, zobrazí Vám malé okno se všemi soubory, které se mají změny podle záplatového souboru. <placeholder-1/> Je-li název souboru zobrazen v černé barvě, pak záplatu lze použít bez problémů. To znamená, že soubor není podle záplaty zastaralý. Nicméně pokud název souboru je zobrazen v červené barvě, pak záplatu nelze použít přímo, protože jste již tento soubor změnili.

source: But don't worry. If you're working with Subversion you can retrieve an older version of the file and resolve the conflict. In fact, TortoiseMerge automatically tries to get that older version of the file and then shows you the diff between <emphasis>Base</emphasis> (the older version of the file), <emphasis>Mine</emphasis> (the file as it is currently in your working copy) and <emphasis>Theirs</emphasis> (the older version of the file with the patch already applied). Then you can resolve possible conflicts manually.
cs: Ale nebojte se. Pokud pracujete se Subversion můžete získat starší verzi souboru a konflikt vyřešit. Ve skutečnosti, TortoiseMerge se automaticky pokusí dostat tuto starší verzi souboru a pak můžete vidět rozdíl mezi <emphasis>Původní</emphasis> (Starší verze souboru), <emphasis>Můj</emphasis> (Soubor, jaký v současnosti je ve Vaší pracovní kopii) a <emphasis>Jejich</emphasis> (Starší verze souboru s již použitou záplatou). Pak můžete případné konflikty řešit ručně.

source: Depending on whether TortoiseMerge can apply the patch directly or by fetching an older version of the file first, it shows you a two pane view (patch can be applied directly) or a three pane view (older version of file fetched).
cs: V závislosti na tom, zda TortoiseMerge může uplatnit záplatu přímo, nebo nejdříve získáním starší verze souboru, ukáže buď dvou panelové zobrazení (záplatu lze aplikovat přímo), nebo tří panelové zobrazení (získaná starší verze souboru).

source: Buttons and Other Controls
cs: Tlačítka a Další Ovládání

source: The Toolbar
cs: Panel nástrojů

source: <guibutton>Open</guibutton> accesses the file-open dialog. What else?
cs: <guibutton>Otevřít</guibutton> zobrazí dialogové okno otevřít soubor. Co jiného?

source: <guibutton>Save</guibutton> saves any changes you have made.
cs: <guibutton>Uložit</guibutton> uloží všechny změny, které jste provedli.

source: <guibutton>Reload</guibutton> discards any changes you have made in TortoiseMerge and reloads the files from disk.
cs: <guibutton>Znovu načíst</guibutton> zahodí veškeré změny provedené v TortoiseMerge a znovu načte soubory z disku.

source: <guibutton>Undo</guibutton> implements a multi-level undo, allowing you to reverse any changes you have made within TortoiseMerge.
cs: <guibutton>Zpět</guibutton> zavádí mnohoúrovňové zpět zrušení, což Vám umožní navrátit všechny změny provedené v rámci TortoiseMerge.

source: <guibutton>Prev/Next Difference</guibutton> jumps directly to the next point where the files differ. This saves scrolling through all the unchanged parts of the file.
cs: <guibutton>Před/Další Rozdíl</guibutton> skočí přímo na další místo, kde se soubory liší. To Vás ušetří posouvání všemi nezměněnými částmi souboru.

source: When you do this in 2-pane diff mode, the detail bar at the bottom of the screen will show you the inline differences for the first line, regardless of where the mouse is hovering.
cs: Když toto uděláte v dvoupanelovém zobrazení porovnání, bude řádek detaily v dolní části obrazovky zobrazovat rozdíly v řádku na prvním řádku, bez ohledu na to, kde je myš umístěna.

source: <guibutton>Prev/Next Conflict</guibutton> jumps directly to the next point where the file differences are in conflict and need to be resolved.
cs: <guibutton>Před/Další Konflikt </guibutton> skočí přímo na další bod, kde jsou rozdíly souboru v konfliktu a je třeba je vyřešit.
