Repository: assembla/tsvn
Catalog: doc/po/TortoiseMerge_*.po
Languages: cs

source: <guibutton>Use Theirs/Use Mine</guibutton> selects whether to use a block from the left or the right pane. Refer to the next section for more information about editing changes and conflicts.
cs: <guibutton>Použít Jejích/Použít Můj </guibutton> zvolí, zda použít blok z levého nebo pravého panelu. Podívejte se na další část pro více informací o úpravách změn a konfliktů.

source: <guibutton>Theirs before Mine/Mine before Theirs</guibutton> is used when you want to combine changes in a conflicted file. Refer to the next section for more information about editing changes and conflicts.
cs: <guibutton>Jejich před Mým/Můj před Jejich</guibutton> se používá, když chcete zkombinovat změny v konfliktním souboru. Podívejte se na další část pro více informací o úpravách změn a konfliktů.

source: <guibutton>Mark as Resolved</guibutton> When you have resolved all the conflicts in a file and saved the changes, you can mark it as resolved from within TortoiseMerge, rather than going back to explorer and marking as resolved from there.
cs: <guibutton>Označit jako vyřešený</guibutton> Když jste vyřešili všechny konflikty v souboru a uložili změny, můžete jej označit jako vyřešený zevnitř TortoiseMerge, raději než jít zpátky do průzkumníka a označit jako vyřešený odtamtud.

source: <guibutton>Show Whitespaces</guibutton> toggles the option to display space and tab characters as symbols so you can distinguish white space changes.
cs: <guibutton>Zobrazit Mezery</guibutton> zapne možnost zobrazení mezer a na znaků tabulátoru jako symboly, takže můžete rozlišit změny v mezerách.

source: <guibutton>Inline Diff Word-wise</guibutton> toggles the method used to display inline diffs. In word-wise mode, when a character is changed, the whole word is highlighted. In char-wise mode, each individual changed character is highlighted.
cs: <guibutton>Rozdíly na řádcích podle slov</guibutton> zapíná metodu sloužící k zobrazení rozdílů v řádcích. V režimu podle slov, když se znak změnil, je zvýrazněno celé slovo. V režimu podle znaků jsou zvýrazněny jednotlivé změněné znaky.

source: Word-wise is the default and in most cases it works better. For example if you change a variable name, the whole name is highlighted in word-wise mode, whereas in char-wise mode you tend to get a mess of added and deleted characters which doesn't make much sense. However, some content does not resolve neatly into words, for example a hex file, and in that case, char-wise display works better.
cs: Podle slov je výchozí a ve většině případů funguje lépe. Například pokud změníte název proměnné, v režimu podle slov je celý název zvýrazněn, zatímco v režimu podle znaků máte sklon mít nepořádek v přidaných a odstraněných znacích, což nedává moc smysl. Nicméně, některé obsahy nejdou rozdělit úhledně do slov, například hex soubor a v tom případě, zobrazení podle znaků je lepší.

source: <guibutton>Switch View</guibutton> selects between one-pane and two-pane view. Disabled in 3-pane view.
cs: <guibutton>Přepnout zobrazení</guibutton> volí mezi jedno panelovým a dvou panelovým zobrazení. Vypnuto v třípanelovém zobrazení.

source: <guibutton>Switch Left and Right View</guibutton> In 2-pane view, swaps the left and right windows. When you are comparing a file in 2 different trees, as opposed to 2 revisions of the same file, TortoiseSVN does not know which one should go in the left pane as the <quote>original/base</quote> version. If it gets this wrong, you can change it to make viewing easier.
cs: <guibutton>Přepnout Levé a Pravé Zobrazení</guibutton> Ve dvou panelovém zobrazení, vymění levé a pravé okno. Když porovnáváte soubor ve 2 různých stromech, na rozdíl od 2 revizí stejného souboru, TortoiseSVN neví, který z nich by měl jít do levé části okna, jako <quote>originální/základní</quote> verze. Pokud je to špatně, můžete jej změnit, aby bylo prohlížení jednodušší.

source: <guibutton>Show/Hide Patch List</guibutton> When TortoiseMerge has a patch list, this button allows you to hide it (so you can see both windows), or show it (so you can review the file list).
cs: <guibutton>Skrýt/Zobrazit seznam záplat</guibutton> Když TortoiseMerge má seznam záplat, toto tlačítko Vám ho umožňuje skrýt (takže můžete vidět obě okna), nebo ukázat (takže si můžete zkontrolovat seznam souborů).

source: <guibutton>Settings</guibutton> takes you to TortoiseMerge's settings dialog.
cs: <guibutton>Nastavení</guibutton> Vás dostane do dialogového okna nastavení TortoiseMerge.

source: <placeholder-1/> Below the menu bar lies the tool bar. This provides easy access to the most commonly used tools, which are <placeholder-2/>
cs: <placeholder-1/> Pod menu se nachází panel nástrojů. Poskytuje snadný přístup k nejčastěji používaným nástrojům, které jsou <placeholder-2/>

source: On the left side of the window is a locator bar. This provides a quick visual reference as to where the changes lie within the file. The bar has three columns. The left column refers to the left pane, the right column to the right pane, and the centre column to the bottom pane (if present). In one-pane view only the left column is used. The locator bar can also be used as a scroll bar to scroll all the windows simultaneously.
cs: Na levé straně okna je lišta umístění. Poskytuje rychlou vizuální referenci o tom, kde leží změny uvnitř souboru. Lišta má tři sloupce. Levý sloupec odkazuje na levý panel, pravý sloupec na pravý panel a střední sloupec na dolní panel (pokud existuje). V jedno panelovém pohledu je použit pouze levý sloupec. Lišta umístění může být také použita jako posuvník pro posun všech oken najednou.

source: Below the bottom window is the status bar. This shows the number of lines added and deleted in <literal>Theirs</literal> and <literal>Mine</literal>, and the number of unresolved conflicts remaining. You can also see which line-ending style is in use, what encoding (ASCII, UTF-8, etc) is assumed by TortoiseMerge, and whether there is a byte-order-mark (BOM) present in UTF-8 files. The left side of the status bar is used to display hints when you hover the mouse over a control.
cs: Pod spodním oknem je stavový řádek. Ukazuje počet přidaných a odstraněných řádků v <literal>Jejich</literal> a <literal>Mém</literal> a počet zbývajících nevyřešených konfliktů. Můžete také vidět, který styl konců řádků je použit, jaké kódování TortoiseMerge předpokládá (ASCII, UTF-8, atd.) a zda je označení pořadí bajtů (BOM) přítomno v souborech UTF-8. Levá strana stavového řádku se používá pro zobrazení popisu, když myší najedete nad kontrolu.

source: Line Status Icons
cs: Ikony Stavu Řádků

source: Changed lines are marked with an icon to indicate what type of change has occurred.
cs: Změněné řádky jsou označeny ikonou označující, jaký typ změny nastal.

source: <graphic fileref="images/TMerge_lineadded.png"/> A line has been added.
cs: <graphic fileref="images/TMerge_lineadded.png"/> Byl přidán řádek

source: <graphic fileref="images/TMerge_lineremoved.png"/> A line has been removed.
cs: <graphic fileref="images/TMerge_lineremoved.png"/> Řádek byl odebrán.

source: <graphic fileref="images/TMerge_lineequal.png"/> A change has been undone by reverting to the original content of the line.
cs: <graphic fileref="images/TMerge_lineequal.png"/> Byla vrácena změna navrácením k původnímu obsahu řádku.

source: <graphic fileref="images/TMerge_linewhitespace.png"/> This line contains only whitespace changes. Where several consecutive lines are marked, the paragraph may have been re-wrapped, causing words to shuffle onto adjacent lines.
cs: <graphic fileref="images/TMerge_linewhitespace.png"/> Tento řádek obsahuje pouze změny mezer. Tam, kde je vyznačeno několik po sobě jdoucích řádků, mohl být odstavec znovu zalomen, což způsobilo, že slova se pošoupla na vedlejší řádky.

source: <graphic fileref="images/TMerge_lineedited.png"/> A line has been edited by hand, using TortoiseMerge as a text editor.
cs: <graphic fileref="images/TMerge_lineedited.png"/> Řádek byl upraven ručně, pomocí TortoiseMerge jako textového editoru.

source: <graphic fileref="images/TMerge_lineconflicted.png"/> This line is in conflict.
cs: <graphic fileref="images/TMerge_lineconflicted.png"/> Tento řádek je v konfliktu.

source: <graphic fileref="images/TMerge_lineconflictedignored.png"/> This line is conflicted, but the effect is hidden by whitespace or line-ending settings.
cs: <graphic fileref="images/TMerge_lineconflictedignored.png"/> Tento řádek je v konfliktu, ale účinek je skryt mezerou nebo nastavením konce řádků.

source: Merging / Editing Conflicts
cs: Sloučení/Úprava konfliktů

source: TortoiseMerge not only <emphasis>shows</emphasis> you the differences between files but also lets you resolve conflicts or apply changes.
cs: TortoiseMerge Vám nejenom <emphasis>zobrazuje</emphasis> rozdíly mezi soubory, ale také umožňuje řešit konflikty, nebo použít změny.

source: Sometimes you actually want both text blocks, and the context menu also offers you <menuchoice><guimenu>Context Menu</guimenu><guimenuitem>Use both text blocks (this one first)</guimenuitem></menuchoice> and <menuchoice><guimenu>Context Menu</guimenu><guimenuitem>Use both text blocks (this one last)</guimenuitem></menuchoice>.
cs: Někdy ale opravdu chcete oba bloky textu a kontextové menu Vám také nabízí <menuchoice><guimenu>Kontextové menu</guimenu><guimenuitem>Použít oba textové bloky (tento první)</guimenuitem></menuchoice> a <menuchoice><guimenu>Kontextové menu</guimenu><guimenuitem>Použít oba textové bloky (tento poslední)</guimenuitem></menuchoice>.

source: You can also edit the output file just as you would in a text editor. Such lines are marked using a pencil icon. Please note that if you want to make any of the line/block-based changes described above, it is better to do those first since once you start editing the file yourself it becomes impossible for TortoiseMerge to keep track of the relationship to the original files.
cs: Můžete také upravit výstupní soubor stejně, jako v textovém editoru. Takové řádky jsou označeny ikonou tužky. Vezměte prosím na vědomí, že pokud chcete provést některé změny řádků/bloků popsané výše, je lepší toto udělat jako první, protože jakmile začnete upravovat soubor sami, stane se nemožné pro TortoiseMerge sledovat vztah k původnímu souboru.

source: Sometimes a file will be marked as conflicted in Subversion, yet when you view it using TortoiseMerge there are no conflicts shown. This may be due to the whitespace handling you have chosen. If you choose to ignore line-endings or whitespace changes, those lines will be marked using the <emphasis>Conflict-Ignored</emphasis> icon. To resolve the conflict you still need to pick which version you want to use.
cs: Někdy bude soubor označen jako konfliktní v Subversion, ale při zobrazení pomocí TortoiseMerge nejsou zobrazeny žádné konflikty. To může být způsobeno zacházením s mezerami, které jste vybrali. Pokud se rozhodnete ignorovat konce řádků nebo změny mezer, budou tyto řádky označeny ikonou <emphasis>Konflikt-Ignorované</emphasis>. Chcete-li konflikt vyřešit, stále musíte vybrat, kterou verzi chcete použít.

source: Sometimes the conflict is too difficult to resolve by simply picking <literal>Theirs</literal> and <literal>Mine</literal> and it requires hand editing. TortoiseMerge allows you to do all the easy changes visually first and then save the file, leaving only the difficult changes to be resolved by hand-editing.
cs: Někdy je konflikt příliš složité vyřešit prostým výběrem <literal>Jejich</literal> a <literal>Můj</literal> a vyžaduje ruční úpravy. TortoiseMerge Vám umožní udělat všechny snadné změny vizuálně a pak soubor uložit, takže jen těžké změny musí být vyřešen ručními úpravami.

source: Note that if you use TortoiseMerge on the same files again, any changes to your working copy, whether in TortoiseMerge, or by hand-editing, <emphasis>will be discarded</emphasis> and the file will appear as it did when conflict-editing first started.
cs: Nezapomeňte, že pokud použijete TortoiseMerge na stejné soubory znova, všechny změny ve Vaší pracovní kopii, ať už v TortoiseMerge, nebo ručními úpravami, <emphasis>budou zahozeny</emphasis> a soubor se zobrazí jako při první úpravě konfliktů.

source: Open Files
cs: Otevřít Soubory

source: When you start TortoiseMerge without any command line switches then you have to open the files manually, using <menuchoice><guimenu>File</guimenu><guimenuitem>Open</guimenuitem></menuchoice>.
cs: Když spustíte TortoiseMerge bez jakýchkoli přepínačů v příkazovém řádku pak musíte otevřít soubory ručně, použitím <menuchoice><guimenu>Soubor</guimenu><guimenuitem>Otevřít</guimenuitem></menuchoice>.

source: The Open Dialog
cs: Dialogové okno Otevřít

source: The first thing you have to do is to decide whether you just want to compare/merge files, or whether you want to apply a patch file. Depending on what you choose, the corresponding edit boxes and browse buttons are activated.
cs: První věc, kterou musíte udělat, je rozhodnout, zda chcete jen porovnat/slučovat soubory, nebo zda chcete použít záplatový soubor. V závislosti na tom, co si vyberete, budou aktivována odpovídající textová pole a tlačítka Procházet.

source: If you want to compare / merge files you have to set at least two of the three possible paths for <literal>Base</literal>, <literal>Mine</literal> and <literal>Theirs</literal>. If you select only two files, then TortoiseMerge will show you the differences between those two files, either in a two pane view or in a one pane view.
cs: Pokud chcete porovnávat/slučovat soubory, musíte nastavit alespoň dvě ze tří možných cest pro <literal>Originál</literal>, <literal>Můj</literal> a <literal>Jejich</literal>. Zvolíte-li pouze dva soubory, pak TortoiseMerge Vám zobrazí rozdíly mezi těmito dvěma soubory a to buď ve dvou panelovém nebo v jedno panelovém zobrazení.

source: If you want to merge three files, TortoiseMerge will show you the differences in a three pane view. This view is generally used if you need to resolve conflicted files. The output file is not named in this case and you will have to use the <menuchoice><guimenu>File</guimenu><guimenuitem>Save As...</guimenuitem></menuchoice>. to save the results.
cs: Pokud chcete sloučit tři soubory, TortoiseMerge Vám rozdíly ukáže ve tři panelovém zobrazení. Toto zobrazení je obecně používáno, pokud potřebujete vyřešit konfliktní soubory. Výstupní soubor není v tomto případě pojmenován a budete muset použít <menuchoice><guimenu>Soubor</guimenu><guimenuitem>Uložit jako...</guimenuitem></menuchoice> pro uložení výsledků.

source: If you want to apply a patch file you have to set both the path to the patch file itself and the path to the folder where the patch file should be applied.
cs: Pokud chcete použít záplatový soubor, musíte nastavit i cestu k samotnému souboru a cestu k adresáři, kde by měl být použit.

source: Currently, only patch files in <emphasis>Unified Diff Format</emphasis> are supported. And only files which were generated from a Subversion working copy. Other formats like patch files generated by CVS are currently not supported!
cs: V současné době jsou záplatové soubory podporovány pouze ve <emphasis>Formátu Sjednoceného Rozdílu</emphasis>. A pouze ty, které byly vytvořeny z pracovní kopie Subversion. Jiné formáty, jako je záplatový soubor vytvořený CVS, nejsou momentálně podporovány!

source: Settings
cs: Nastavení

source: Main Settings Page
cs: Stránka Hlavní Nastavení

source: The Settings Main Page
cs: Stránka Hlavní nastavení

source: Most of the options here are self-explanatory, but a few points need clarifying.
cs: Většina voleb zde je evidentní, ale pár bodů je třeba vyjasnit.

source: <guilabel>Backup original file</guilabel> renames the original file in the WC to <literal>filename.bak</literal> before saving the modified version.
cs: <guilabel>Zálohovat původní soubor</guilabel> přejmenuje původní soubor v pracovní kopii na <literal>jmenosouboru.bak</literal> před uložením upravené verze.

source: <guilabel>Ignore line endings</guilabel> hides changes which are due solely to difference in line-end style.
cs: <guilabel>Ignorovat konce řádků</guilabel> skryje změny, které jsou pouze z důvodu rozdílu ve stylu konce řádků.

source: <guilabel>Ignore case changes</guilabel> hides changes which are due solely to case changes within the text. This can be useful with apps such as Visual Basic, which changes case in variables without warning.
cs: <guilabel>Ignorovat změny velikosti</guilabel> skryje změny, které jsou pouze z důvodu změn velikosti textu. To může být užitečné v aplikacích, jako je Visual Basic, který mění velikost proměnných bez varování.

source: <guilabel>Colour code in-line changes</guilabel> uses the same scheme as the line diff bar to show the detailed in-line changes within the main display panes. Lines which have been heavily modified will not be shown using this method as the results are simply confusing. In this case the line will be shown as replaced (old line deleted, new line added).
cs: <guilabel>Barevně vyznačit změny v řádcích</guilabel> používá stejný systém jako sloupec porovnání řádků, ukazující podrobné změny v řádcích v rámci hlavních panelů zobrazení. Řádky, které byly velmi změněny nebudou zobrazeny pomocí této metody protože výsledky by byly prostě matoucí. V tomto případě bude řádek zobrazen jako vyměněný (starý řádek smazán, nový řádek přidán).

source: <guilabel>Compare whitespaces</guilabel> shows all changes in indentation and inline whitespace as added/removed lines (which is how Subversion treats such changes).
cs: <guilabel>Porovnat mezery</guilabel> zobrazí všechny změny v odsazení a mezerách mezi řádky jako přidané/smazané řádky (a takto Subversion zachází s takovými změnami).

source: <guilabel>Ignore all whitespaces</guilabel> hides all whitespace-only changes.
cs: <guilabel>Ignorovat všechny mezery</guilabel> skryje všechny změny způsobené mezerami.

source: Colour Settings Page
cs: Stránka Nastavení Barev

source: The Settings Color Page
cs: Stránka Nastavení Barev

source: This dialog allows you to select the background color coding used to highlight the different line changes.
cs: Toto dialogové okno Vám umožňuje vybrat vyznačení barev pozadí používané pro zvýraznění různých změn řádku.

source: Normal
cs: Normální

source: All lines which are unchanged, or where changes are hidden.
cs: Všechny řádky, které jsou beze změny, nebo kde jsou změny skryty.

source: Added
cs: Přidaný

source: Lines which have been added.
cs: Řádky, které byly přidány.

source: Removed
cs: Odstraněný

source: Lines which have been deleted.
cs: Řádky, které byly odstraněny.

source: Modified
cs: Změněný

source: unchanged
cs: nezměněnou

source: Colour code in-line changes
cs: Barevně vyznačit změny v řádce

source: Lines which have relatively small changes, and are shown using inline diff. This colour is used for the <placeholder-1/> portion of the line content. Changed portions will be shown using the inline added and deleted colours described below. If <placeholder-2/> is not enabled, this colour will not be used and changed lines will always be shown as replacements.
cs: Řádky, které mají relativně malé změny a jsou zobrazeny pomocí porovnání řádků. Tato barva se používá pro <placeholder-1/> část obsahu v řádku. Změněné části se zobrazí pomocí barev přidáno a smazáno v řádku popsané níže. Pokud <placeholder-2/> není povoleno, tato barva nebude použita a změněné řádky se vždy zobrazí jako nahrazené.

source: Conflicted
cs: Konfliktní

source: Where the same line has been changed in both files.
cs: Kde stejný řádek byl změněn v obou souborech.

source: Conflict resolved
cs: Konflikt vyřešen

source: Where the same line has been changed in both files, and you have now selected which version should be used.
cs: Kde stejná položka byla změněna v obou souborech, a Vy jste vybrali, která verze by měla být použita.

source: Empty
cs: Prázdný

source: Where lines have been added in the opposite pane, and no such line existed in this pane.
cs: Kde řádky byly přidány v protějším panelu a žádný takový řádek v tomto panelu neexistuje.

source: Inline added text
cs: Do řádku přidaný text

source: When inline diffs are shown, added text is shown in this colour.
cs: Jsou-li zobrazeny rozdíly v řádcích, přidaný text je uveden v této barvě.

source: Inline removed text
cs: Z řádku odstraněný text

source: When inline diffs are shown, deleted text is shown in this colour.
cs: Jsou-li zobrazeny rozdíly v řádcích, smazaný text je uveden v této barvě.

source: Misc whitespaces
cs: Různé mezery

source: Characters used to indicate Whitespace are shown in a different colour from normal text.
cs: Znaky používané k označení Mezer jsou zobrazeny v různých barvách od normálního textu.

source: keyboard shortcuts
cs: klávesové zkratky

source: List of keyboard shortcuts and commands.
cs: Seznam klávesových zkratek a příkazů.

source: Keyboard shortcuts
cs: Klávesové zkratky

source: Quit the program
cs: Ukončit program

source: Copy the selected text to the clipboard
cs: Kopírovat vybraný text do schránky

source: Open the Find dialog for text searches
cs: Otevře dialogové okno Najít pro vyhledávání textu

source: Open files to diff/merge
cs: Otevře soubory k porovnání/sloučení

source: Save the changes
cs: Uložit změny

source: Save as...
cs: Uložit jako...

source: Go to next difference
cs: Přejít na další rozdíl

source: Go to previous difference
cs: Přejít na předchozí rozdíl

source: Go to next conflict
cs: Přejít na další konflikt

source: Go to previous conflict
cs: Přejít na předchozí konflikt

source: Toggle between one-pane diff and two-pane diff
cs: Přepínat mezi jedno panelovým a dvou panelovým porovnáním

source: Reload the files and revert all changes made
cs: Znovu nahraje soubory a vrátit všechny provedené změny

source: Toggles between showing whitespaces or not
cs: Přepíná mezi zobrazením mezer, nebo ne

source: Ctrl-mousewheel
cs: Ctrl-kolečko myši

source: Scroll the display left/right
cs: Posunuje zobrazení doleva/doprava

source: Automating TortoiseMerge
cs: Automatizace TortoiseMerge

source: TortoiseMerge can be started with command line parameters to avoid having to go through the <guilabel>Open</guilabel> dialog to select the files yourself. This is useful also if you want to use TortoiseMerge from another application.
cs: TortoiseMerge může být spuštěn s parametry příkazového řádku, abyste se vyhnuli procházení dialogovým oknem <guilabel>Otevřít</guilabel> pro výběr souborů. To je také užitečné pokud chcete použít TortoiseMerge z jiné aplikace.

source: TortoiseMerge Command Line Switches
cs: Přepínače TortoiseMerge v příkazovém řádku

source: automation
cs: automatizace

source: command line
cs: příkazový řádek

source: Most switches require additional information like a path or some other string. In those cases, append an ':' to the switch and put the string/path after it. Example: <screen> /base:"c:\folder\my base file.txt" </screen>
cs: Většina přepínačů požaduje další informace, jako cestu, nebo nějaký jiný řetězec. V těchto případech do přepínače přidejte ':' a řetězec/cesta zadejte po něm. Příklad: <screen> /base:"c:\adresář\můjpůvodsoubor.txt" </screen>

source: List of available command line options
cs: Seznam dostupných voleb příkazové řádky

source: Command
cs: Příkaz

source: Description
cs: Popis

source: Shows a dialog box with the most important command line switches.
cs: Zobrazí dialogové okno s nejdůležitějšími přepínači příkazového řádku.

source: The same as <placeholder-1/>.
cs: Stejné jako <placeholder-1/> .

source: base
cs: původní
