Repository: assembla/tsvn
Catalog: doc/po/TortoiseMerge_*.po
Languages: cs

source: Specifies the <placeholder-1/> file used in three way diffs. This is the common ancestor of the files being diffed, although it is not shown in a separate window. For two way diffs, this is the left file.
cs: Určuje <placeholder-1/> soubor používaný v trojím porovnávání. Je společný předek porovnávaných souborů, ačkoli není zobrazen v samostatném okně. V dvojím porovnávání, je to soubor vlevo.

source: The name of the base file. This is shown in the view title instead of the file path. For three way diffs it is shown in a tooltip for the view title.
cs: Název původního souboru. Je zobrazen v zobrazení názvu namísto cesty k souboru. V trojím porovnávání je uveden v popisku zobrazení názvu.

source: theirs
cs: jejich

source: Specifies the <placeholder-1/> file used in three way diffs, displayed in the left pane.
cs: Určuje <placeholder-1/> soubor používaný v trojím porovnávání, zobrazí se v levém panelu.

source: The name of the theirs file. This is shown in the view title instead of the file path.
cs: Název jejich souboru. Je zobrazeno v zobrazení názvu namísto cesty k souboru.

source: mine
cs: můj

source: Specifies the <placeholder-1/> file used in three way diffs, displayed in the right pane. For two way diffs, this is the right file.
cs: Určuje <placeholder-1/> soubor používaný v trojím porovnávání, zobrazí se v pravém panelu. V dvojím porovnávání, je to soubor vpravo.

source: The name of the mine file. This is shown in the view title instead of the file path.
cs: Název mého souboru. Je zobrazen v zobrazení názvu namísto cesty k souboru.

source: merged
cs: sloučený

source: Specifies the resulting <placeholder-1/> file used in three way diffs. This is the file path where the result of the merge/conflict resolving is saved. If this is not set, then TortoiseMerge will ask the user where to save the result.
cs: Určuje výsledný <placeholder-1/> soubor používaný v trojím porovnávání. Je to cesta k souboru, kde je v důsledku sloučení/řešení konfliktů uložen. Pokud toto není nastaveno, pak TortoiseMerge požádá uživatele, kam se výsledek má uložit.

source: The name of the merged file. This is shown in the view title instead of the file path.
cs: Jméno sloučeného souboru. Je zobrazeno v zobrazení názvu namísto cesty k souboru.

source: very long
cs: velmi dlouho

source: The path where a patch should be applied to. If you don't set this path, then TortoiseMerge will try to find the path itself to match the paths in the patch file, but that can take <placeholder-1/>.
cs: Cesta, kde by záplata měla být použita. Pokud nechcete nastavit tuto cestu, pak se TortoiseMerge bude snažit najít cestu samo, aby se shodovala s cestou v záplatovém souboru, ale to může trvat <placeholder-1/>.

source: The name of the original file to patch. Used for the view title.
cs: Název původního souboru na opravu. Používá se pro zobrazení názvu.

source: The name of the resulting patched file. Used for the view title.
cs: Jméno výsledného záplatového souboru. Používá se pro zobrazení názvu.

source: The path to the patch/diff file to apply to a directory.
cs: Cesta k záplatovém/porovnávacímu souboru k použití na adresář.

source: Forces TortoiseMerge to start with the one-way view instead of the view the user specified in the settings.
cs: Donutí TortoiseMerge spustit v jedno panelovém zobrazení namísto pohledu, který uživatel v nastavení zadal.

source: Switches the left and right view of the specified two files to diff.
cs: Přepíná nezi levým a pravým zobrazením uvedených dvou souborů k porovnání.

source: /origfile:"path_to_original_file"
cs: /origfile:"cesta_k_původnímu_souboru"

source: /modifiedfile:"path_to_modified_file"
cs: /modifiedfile:"ke_změněnému_souboru"

source: /outfile:"path_to_resulting_patchfile"
cs: /outfile:"cesta_k_výslednému_záplatovému_souboru"

source: Creates a unified diff file (patch file) of two files specified with <placeholder-1/> and <placeholder-2/>. The target path is set with <placeholder-3/>. If <placeholder-4/> is not set, a file save dialog is shown so the user can choose the location to save the patch file. Note: If <placeholder-5/> is set, all other parameters are ignored.
cs: Vytvoří soubor jednotného rozdílu (záplatový soubor) dvou souborů zadaných <placeholder-1/> a <placeholder-2/>. Cílová cesta se nastavuje <placeholder-3/>. Pokud <placeholder-4/> není nastaven, zobrazí se dialogové okno uložit soubor, takže uživatel může vybrat umístění pro uložení záplatového souboru. Poznámka: Pokud je nastaven <placeholder-5/>, všechny ostatní parametry jsou ignorovány.

source: You can also supply simple filenames on the command line for compatibility with other diff programs. In this simplified form the command line is <screen> TortoiseMerge BaseFilePath MyFilePath [ TheirFilePath ] </screen> If two files are given they will be compared with each other. If three files are given, the first is taken as the BASE file, and the other two are compared with it in a three-way diff.
cs: Můžete také dodat jednoduché názvy souborů na příkazovém řádku pro kompatibilitu s jinými programy rozdílů. V této zjednodušené formě je příkazový řádek <screen> TortoiseMerge CestaPůvSoubor CestaMůjSoubor [CestaJejichSoubor]</screen> jestliže jsou evedeny dva soubory budou porovnány mezi sebou. Pokud jsou uvedeny tři soubory, první je brán jako původní soubor a ostatní dva jsou s ním porovnány v trojím porovnávání.

source: Glossary
cs: Slovník pojmů

source: Add
cs: Přidat

source: A Subversion command that is used to add a file or directory to your working copy. The new items are added to the repository when you commit.
cs: Příkaz Subversion, který slouží k přidání souboru nebo adresáře do Vaší pracovní kopie. Nové položky jsou do úložiště přidány při odevzdání.

source: BASE revision
cs: Základní revize

source: The current base revision of a file or folder in your <emphasis>working copy</emphasis>. This is the revision the file or folder was in, when the last checkout, update or commit was run. The BASE revision is normally not equal to the HEAD revision.
cs: Aktuální základní revize souboru nebo adresáře ve Vaší <emphasis>pracovní kopii</emphasis> . Jedná se o revizi, v které soubor nebo adresář byl, při posledním spuštění získání, aktualizace nebo odevzdání. BASE revize se obvykle rovná revizi HEAD.

source: Blame
cs: Obvinit

source: This command is for text files only, and it annotates every line to show the repository revision in which it was last changed, and the author who made that change. Our GUI implementation is called TortoiseBlame and it also shows the commit date/time and the log message when you hover the mouse of the revision number.
cs: Tento příkaz je pouze pro textové soubory, okomentuje každý řádek pro zobrazení revize úložiště, v němž byl naposledy změněn a autora, který tuto změnu provedl. Naše GUI implementace se nazývá TortoiseBlame a také ukazuje datum, čas a zprávu odevzdání, když podržíte myš nad číslem revize.

source: Berkeley DB. A well tested database backend for repositories, that cannot be used on network shares. Default for pre 1.2 repositories.
cs: Berkeley Databáze. Prověřený databázový backend pro úložiště, které nelze použít ve sdílené síti. Výchozí pro úložiště před verzí 1.2.

source: Branch
cs: Větev

source: A term frequently used in revision control systems to describe what happens when development forks at a particular point and follows 2 separate paths. You can create a branch off the main development line so as to develop a new feature without rendering the main line unstable. Or you can branch a stable release to which you make only bug fixes, while new developments take place on the unstable trunk. In Subversion a branch is implemented as a <quote>cheap copy</quote>.
cs: Termín často používaný v systémech pro správu verzí pro popis co se stane, když se vývoj na určitém místě rozdělí a pokračuje po 2 samostatných cestách. Můžete vytvořit větev mimo hlavní linii vývoje, abyste mohli vyvíjet novou funkci, aniž byste hlavní linii učinili nestabilní. Nebo můžete rozvětvit stabilní verzi, na které uděláte jen opravy chyb, zatímco nový vývoj probíhá v nestabilním kmenu. V Subversion je větev zavedena jako <quote>laciná kopie</quote>.

source: Checkout
cs: Získat

source: A Subversion command which creates a local working copy in an empty directory by downloading versioned files from the repository.
cs: Příkaz Subversion, který vytvoří místní pracovní kopii v prázdném adresáři stažením verzí souborů z uložiště.

source: Cleanup
cs: Vyčistit

source: To quote from the Subversion book: <quote> Recursively clean up the working copy, removing locks and resuming unfinished operations. If you ever get a <emphasis>working copy locked</emphasis> error, run this command to remove stale locks and get your working copy into a usable state again. </quote> Note that in this context <emphasis>lock</emphasis> refers to local filesystem locking, not repository locking.
cs: Citujeme z knihy Subversion: <quote>Rekurzivně vyčistí pracovní kopií, odstraní zámky a pokračuje v nedokončených operacích. Pokud někdy máte chybu <emphasis>pracovní kopie uzamčena</emphasis>, spusťte tento příkaz k odstranění starých zámků a dostaňte Vaši pracovní kopie zpět do použitelného stavu.</quote> Nezapomeňte, že v této souvislosti <emphasis>zámek</emphasis> odkazuje na zamknutí v místním souborovém systému, ne zamknutí úložiště.

source: Commit
cs: Odevzdat

source: This Subversion command is used to pass the changes in your local working copy back into the repository, creating a new repository revision.
cs: Tento příkaz Subversion slouží k předání změn v místní pracovní kopii zpět do úložiště, vytvářející novou revizi úložiště.

source: Conflict
cs: Konflikt

source: When changes from the repository are merged with local changes, sometimes those changes occur on the same lines. In this case Subversion cannot automatically decide which version to use and the file is said to be in conflict. You have to edit the file manually and resolve the conflict before you can commit any further changes.
cs: Když se změny z úložiště sloučí s místními změnami, někdy tyto změny nastanou na stejných řádcích. V tomto případě Subversion nemůže automaticky rozhodnout, kterou verzi použít a soubor je tak řečeno v konfliktu. Pro vyřešení konfliktu musíte upravit soubor ručně, než budete moci spáchat další změny.

source: Copy
cs: Kopie

source: In a Subversion repository you can create a copy of a single file or an entire tree. These are implemented as <quote>cheap copies</quote> which act a bit like a link to the original in that they take up almost no space. Making a copy preserves the history of the item in the copy, so you can trace changes made before the copy was made.
cs: V Subversion můžete vytvořit kopii jednoho souboru nebo celého stromu. Ty jsou realizovány jako <quote>laciné kopie</quote> které působí trochu jako odkaz na původní kopii v tom, že nezabírají téměř žádný prostor. Zhotovení kopie zachová historii položky v kopii, takže můžete sledovat změny provedené dříve, než byla kopie vytvořena.

source: Delete
cs: Smazat

source: When you delete a versioned item (and commit the change) the item no longer exists in the repository after the committed revision. But of course it still exists in earlier repository revisions, so you can still access it. If necessary, you can copy a deleted item and <quote>resurrect</quote> it complete with history.
cs: Když odstraníte položku s verzí (a změnit odevzdáte), položka již v úložišti po odevzdané revizi neexistuje. Ale samozřejmě, že ještě existuje v předchozích revizích úložiště, takže můžete stále k ní mít přístup. Pokud je to nutné, můžete zkopírovat odstraněnou položku a <quote>vzkřísit</quote> ji úplně i s historií.

source: Diff
cs: Porovnat

source: Shorthand for <quote>Show Differences</quote>. Very useful when you want to see exactly what changes have been made.
cs: Zkratka pro <quote>Zobrazit Rozdíly</quote>. Velmi užitečné, pokud chcete přesně zjistit, jaké změny byly provedeny.

source: Export
cs: Exportovat

source: This command produces a copy of a versioned folder, just like a working copy, but without the local <literal>.svn</literal> folders.
cs: Tento příkaz vytvoří kopii adresáře s verzí, stejně jako pracovní kopie, ale bez místních adresářů <literal>.Svn</literal>.

source: A proprietary Subversion filesystem backend for repositories. Can be used on network shares. Default for 1.2 and newer repositories.
cs: Vlastní backend souborového systému Subversion pro úložiště. Může být použit v sdílené síti. Výchozí pro úložiště od verze 1.2 a novější.

source: Group policy object
cs: Objekt zásad skupiny

source: HEAD revision
cs: revize HEAD

source: The latest revision of a file or folder in the <emphasis>repository</emphasis>.
cs: Poslední revize souboru nebo adresáře v <emphasis>úložišti</emphasis>.

source: Subversion command to import an entire folder hierarchy into the repository in a single revision.
cs: Subversion příkaz pro import celé hierarchie adresářů do úložiště v jedné revizi.

source: Lock
cs: Zámek

source: When you take out a lock on a versioned item, you mark it in the repository as non-committable, except from the working copy where the lock was taken out.
cs: Když si vezmete zámek na položku s verzí, označíte ji v úložišti jako neodevzdatelnou, s výjimkou pracovní kopie, kde byl zámek získán.

source: Log
cs: Záznam

source: Show the revision history of a file or folder. Also known as <quote>History</quote>.
cs: Zobrazit historii revizí souboru nebo adresář. Také znám jako <quote>Historie</quote>.

source: History
cs: Historie

source: Show the revision history of a file or folder. Also known as <quote>Log</quote>.
cs: Zobrazit historii revizí souboru nebo adresář. Také znám jako <quote>záznam</quote>.

source: Merge
cs: Sloučit

source: The process by which changes from the repository are added to your working copy without disrupting any changes you have already made locally. Sometimes these changes cannot be reconciled automatically and the working copy is said to be in conflict.
cs: Proces, při kterém změny z úložiště jsou přidány do Vaší pracovní kopie bez přerušení jakýchkoli změn, které jste již místně udělali. Někdy tyto změny nemohou být srovnány automaticky a pracovní kopie je tzv. v konfliktu.

source: Merging happens automatically when you update your working copy. You can also merge specific changes from another branch using TortoiseSVN's Merge command.
cs: Sloučení se děje automaticky při aktualizaci Vaší pracovní kopie. Můžete také sloučit konkrétní změny z jiné větve pomocí TortoiseSVN v příkazu Sloučit.

source: Patch
cs: Záplata

source: If a working copy has changes to text files only, it is possible to use Subversion's Diff command to generate a single file summary of those changes in Unified Diff format. A file of this type is often referred to as a <quote>Patch</quote>, and it can be emailed to someone else (or to a mailing list) and applied to another working copy. Someone without commit access can make changes and submit a patch file for an authorized committer to apply. Or if you are unsure about a change you can submit a patch for others to review.
cs: Pokud pracovní kopie má změny pouze v textových souborech, je možné použít Subversion příkaz porovnat pro vytvoření jednoho souboru shrnující tyto změny ve formátu sjednoceného rozdílu. Soubor tohoto typu je často označován jako <quote>Záplata</quote> a může být poslán e-mailem někomu jinému (nebo do poštovního adresáře) a použít na jinou pracovní kopii. Někdo bez oprávnění k odevzdání může provést změny a předložit záplatový soubor, aby ho oprávněný vývojář mohl použít. Nebo pokud si nejste jisti provedenou změnou, může poslat záplatu ostatním k přezkoumání.

source: Property
cs: Vlastnost

source: In addition to versioning your directories and files, Subversion allows you to add versioned metadata - referred to as <quote>properties</quote> to each of your versioned directories and files. Each property has a name and a value, rather like a registry key. Subversion has some special properties which it uses internally, such as <literal>svn:eol-style</literal>. TortoiseSVN has some too, such as <literal>tsvn:logminsize</literal>. You can add your own properties with any name and value you choose.
cs: Kromě Vašich adresářů a souborů Subversion umožňuje přidat i metadata s verzí - známá jako <quote>vlastnosti</quote> každému z Vašich adresářů a souborů s verzí. Každá vlastnost má název a hodnotu, podobně jako klíč v registru. Subversion má některé speciální vlastnosti, které používá vnitřně, jako je <literal>svn:EOL-style</literal>. TortoiseSVN má taky některé, jako například <literal>tsvn:logminsize</literal>. Můžete přidat vlastní vlastnosti s libovolným názvem a hodnotou, kterou zvolíte.

source: Relocate
cs: Přemístit

source: If your repository moves, perhaps because you have moved it to a different directory on your server, or the server domain name has changed, you need to <quote>relocate</quote> your working copy so that its repository URLs point to the new location.
cs: Pokud se Vaše úložiště přesune, snad proto, že jste ho přestěhovali do jiného adresáře na Vašem serveru, nebo název domény serveru se změnil, je třeba <quote>přemístit</quote> Vaši pracovní kopie tak, aby její URL úložiště odkazovalo na nové umístění.

source: Note: you should only use this command if your working copy is referring to the same location in the same repository, but the repository itself has moved. In any other circumstance you probably need the <quote>Switch</quote> command instead.
cs: Poznámka: měli byste používat tento příkaz pouze, pokud Vaše pracovní kopie odkazuje na stejné místo ve stejném úložišti, ale samotné úložiště se přesunulo. Za všech ostatních okolností, pravděpodobně budete muset místo toho použít příkaz <quote>Překlopit</quote>.

source: Repository
cs: Úložiště

source: A repository is a central place where data is stored and maintained. A repository can be a place where multiple databases or files are located for distribution over a network, or a repository can be a location that is directly accessible to the user without having to travel across a network.
cs: Úložiště je centrální místo, kde jsou data uložena a udržována. Úložiště může být místo, kde se nachází více databází nebo souborů pro distribuci po síti, nebo úložiště může být také místo, které je přímo přístupné uživatelům, aniž by museli cestovat po celé síti.

source: Resolve
cs: Vyřešit

source: When files in a working copy are left in a conflicted state following a merge, those conflicts must be sorted out by a human using an editor (or perhaps TortoiseMerge). This process is referred to as <quote>Resolving Conflicts</quote>. When this is complete you can mark the conflicted files as being resolved, which allows them to be committed.
cs: Pokud jsou soubory v pracovní kopii ponechány po sloučení ve stavu konfliktu, musí být tyto konflikty vyřešeny člověkem pomocí editoru (nebo možná TortoiseMerge). Tento proces je označován jako <quote>Řešení konfliktů</quote>. Až toto skončí, můžete označit konfliktní soubory jako vyřešené, což jim umožní být odevzdány.

source: Revert
cs: Vrátit

source: Subversion keeps a local <quote>pristine</quote> copy of each file as it was when you last updated your working copy. If you have made changes and decide you want to undo them, you can use the <quote>revert</quote> command to go back to the pristine copy.
cs: Subversion udržuje místní <quote>nedotčenou</quote> kopii každého souboru, jaký byl, když jste naposledy aktualizovali Vaši pracovní kopii. Pokud jste provedli změny a rozhodnete se, že je chcete vrátit, můžete použít příkaz <quote>vrátit</quote>, abyste se vrátili k původní kopii.

source: Revision
cs: Revize

source: Every time you commit a set of changes, you create one new <quote>revision</quote> in the repository. Each revision represents the state of the repository tree at a certain point in its history. If you want to go back in time you can examine the repository as it was at revision N.
cs: Pokaždé, když odevzdáte sadu změn, vytvoříte v úložišti jednu novou <quote>revize</quote>. Každá revize představuje stav stromu úložiště v určitém okamžiku v jeho historii. Pokud se chcete vrátit zpět v čase můžete úložiště prozkoumat, jaké bylo v revizi N.

source: In another sense, a revision can refer to the set of changes that were made when that revision was created.
cs: V jiném smyslu, revize odkazuje na sadu změn, které byly provedeny, když byla tato revize vytvořena.

source: Revision Property (revprop)
cs: Vlastnosti revize (revvlast)

source: Just as files can have properties, so can each revision in the repository. Some special revprops are added automatically when the revision is created, namely: <literal>svn:date svn:author svn:log</literal> which represent the commit date/time, the committer and the log message respectively. These properties can be edited, but they are not versioned, so any change is permanent and cannot be undone.
cs: Stejně jako soubory mohou mít vlastnosti, může je mít i každá revize v úložišti. Některé speciální vlastnosti jsou přidány automaticky při vytvoření revize a sice: <literal>svn:Datum svn:autor svn:záznam</literal> které představují datum a čas odevzdání, respektive autora a zprávu záznamu. Tyto vlastnosti lze upravit, ale nemají verzi, takže každá změna je trvalá a nelze ji vrátit zpět.

source: A frequently-used abbreviation for Subversion.
cs: Často používaná zkratka pro Subversion.

source: The name of the Subversion custom protocol used by the <quote>svnserve</quote> repository server.
cs: Název vlastního protokolu Subversion používaného serverem úložiště <quote>svnserve</quote>.

source: Switch
cs: Překlopit

source: Just as <quote>Update-to-revision</quote> changes the time window of a working copy to look at a different point in history, so <quote>Switch</quote> changes the space window of a working copy so that it points to a different part of the repository. It is particularly useful when working on trunk and branches where only a few files differ. You can switch your working copy between the two and only the changed files will be transferred.
cs: Stejně jako <quote>Aktualizovat na revizi</quote> změní časové okno pracovní kopie, aby se podívalo na jiné místo v historii, tak <quote>Překlopit</quote> změní prostorové okno pracovní kopie tak, aby ukazovalo na jinou část úložiště. To je zvláště užitečné při práci na kmeni a větvi, kde se liší jen několik souborů. Můžete mezi nimi svoji pracovní kopii překlopit a jen změněné soubory budou převedeny.

source: Update
cs: Aktualizovat

source: This Subversion command pulls down the latest changes from the repository into your working copy, merging any changes made by others with local changes in the working copy.
cs: Tento příkaz Subversion stáhne poslední změny z úložiště do Vaší pracovní kopie, sloučí změny provedené ostatními s místními změnami v pracovní kopii.

source: Working Copy
cs: Pracovní kopie

source: This is your local <quote>sandbox</quote>, the area where you work on the versioned files, and it normally resides on your local hard disk. You create a working copy by doing a <quote>Checkout</quote> from a repository, and you feed your changes back into the repository using <quote>Commit</quote>.
cs: Toto je Vaše místní <quote>pískoviště</quote>, Oblast, kde budete pracovat na souborech s verzemi a obvykle sídlí na Vašem místním pevném disku. Můžete vytvořit pracovní kopii tím, že ji <quote>Získáte</quote> z úložiště a přivádíte své změny zpět do úložiště pomocí <quote>Odevzdat</quote>.

source: translator-credits
cs: Zbyněk Schwarz <zbynek.schwarz@gmail.com>

source: translator-translation
cs: Překlad
